app/Controllers/Anak.php

SELECT *
FROM `anak_asuh`
WHERE `nip` = '00'
AND `deleted_at` IS NULL
SELECT *
FROM `dokumen_anak`
WHERE `id_anak` = '4'
AND `deleted_at` IS NULL
SELECT *
FROM `perkembangan_anak`
WHERE `id_anak` = '4'
AND `deleted_at` IS NULL
---
  public function profile()
  {
    if ($this->session->get('NAMA') == null)  return redirect()->to(base_url());
    $manak = new Anak_asuh();
    $dataAnak = $manak->where(['nip' => $_GET['nip'], 'deleted_at' => null])->get()->getRowArray();
    $mdokanak = new Dokumen_anak();
    $dokAnak = $mdokanak->where(['id_anak' => $dataAnak['id'], 'deleted_at' => null])->orderBy("id", "DESC")->get()->getResultArray();
    $mperkembangananak = new Perkembangan_anak();
    $perkembanganAnak = $mperkembangananak->where(['id_anak' => $dataAnak['id'], 'deleted_at' => null])->orderBy("id", "DESC")->get()->getResultArray();
    $mortu = new Orangtua_anak();
    $dataOrtu = $mortu->where(['id_anak' => $dataAnak['id'], 'deleted_at' => null])->orderBy("id", "DESC")->get()->getRowArray();
    $data = [
      "page_title" => "Profile Anak",
      "session" => $this->session->get(),
      "anak" => $dataAnak,
      "dokumen_anak" => $dokAnak,
      "perkembangan_anak" => $perkembanganAnak,
      "orangtua" => $dataOrtu
    ];

SELECT *
FROM `anak_asuh`
WHERE `nip` = '00'
AND `deleted_at` IS NULL
---
  public function editPerkembangan()
  {
    if ($this->session->get('NAMA') == null)  return redirect()->to(base_url());
    $dataPerkembangan = $this->db->table("perkembangan_anak p")->join("anak_asuh a", "p.id_anak=a.id")->select("p.*,a.nip,a.nama")->where(['p.id' => $_GET['id'], 'p.deleted_at' => null])->get()->getRowArray();
    $data = [
      "page_title" => "Edit Perkembangan Anak",
      "session" => $this->session->get(),
      "perkembangan" => $dataPerkembangan,
    ];

SELECT *
FROM `orangtua_anak`
WHERE `id_anak` = '4'
AND `deleted_at` IS NULL
ORDER BY `id` DESC
---
  public function editOrangtua()
  {
    if ($this->session->get('NAMA') == null)  return redirect()->to(base_url());
    $manak = new Anak_asuh();
    $dataAnak = $manak->where(['nip' => $_GET['nip'], 'deleted_at' => null])->get()->getRowArray();
    $mortu = new Orangtua_anak();
    $dataOrangtua = $mortu->where(['id_anak' => $dataAnak['id'], 'deleted_at' => null])->orderBy("id", "DESC")->get()->getRowArray();

UPDATE `orangtua_anak` SET `id_anak` = '4', `nama_ayah` = 'Test', `pekerjaan_ayah` = 'buruh', `agama_ayah` = 'Islam', `hp_ayah` = '085877463823', `tempatlahir_ayah` = 'Banyumas', `tgllahir_ayah` = '1979-10-10', `rt_ayah` = '009', `rw_ayah` = '002', `desa_ayah` = 'Lumbis', `kecamatan_ayah` = 'asdas', `kabupaten_ayah` = 'sadasd', `provinsi_ayah` = 'dsad', `nama_ibu` = 'wqsad', `pekerjaan_ibu` = 'dasdj', `agama_ibu` = 'asdiasdmj', `hp_ibu` = '083472304823', `tempatlahir_ibu` = 'SDSBCJSBXC', `tgllahir_ibu` = '1984-12-21', `rt_ibu` = '008', `rw_ibu` = '007', `desa_ibu` = '', `kecamatan_ibu` = 'asdasd', `kabupaten_ibu` = '', `provinsi_ibu` = 'fbdbsdsd'
WHERE `id` = '1'
---
          'provinsi_ibu' => $_POST['provinsiIbu'],
        );
        if (!empty($_POST['idOrtu'])) {
          $data['update'] = $this->db->table("orangtua_anak")->update($input_data, ['id' => $_POST['idOrtu']]);