app/Controllers/Anak.php

  public function get_data()
  {
    if ($this->session->get('NAMA') == null)  return redirect()->to(base_url());
    if ($_GET['act'] == "tabel-anak") {
      $id_panti = $this->session->get('ID_PANTI');
      $manak = new Anak_asuh();
      $dataAnak = $manak->where(['id_panti' => $id_panti, 'deleted_at' => null])->get()->getResultArray();
---
SELECT *
FROM `anak_asuh`
WHERE `id_panti` = '1'
AND `deleted_at` IS NULL