app/Controllers/Auth.php

SELECT *
FROM `user_manager`
WHERE `email` = 'admin@pantiharapanmulia.com'
 LIMIT 1
---
    public function login()
    {
        $mmanager = new Manager();
        $dataManager = $mmanager->where(array('email' => $_POST['email']))->first();