app/Controllers/Dashboard.php

    public function get_data()
    {
        if ($this->session->get('NAMA') == null)  return redirect()->to(base_url());
        if ($_GET['act'] == "reportData") {
            $id_panti = $this->session->get('ID_PANTI');
            $manak = new Anak_asuh();
            $dataAnakAktif = $manak->where(['id_panti' => $id_panti, 'status_anak' => 'Aktif', 'status_panti' => 'Anak Asuh Mukim', 'deleted_at' => null])->get()->getResultArray();
            $dataAnakDalam = $manak->where(['id_panti' => $id_panti, 'status_panti' => 'Anak Asuh Mukim', 'deleted_at' => null])->get()->getResultArray();
            $dataAnakLuar = $manak->where(['id_panti' => $id_panti, 'status_panti' => 'Anak Asuh Luar', 'deleted_at' => null])->get()->getResultArray();
            $mdonatur = new Donatur();
            $dataDonatur = $mdonatur->where(['id_panti' => $id_panti, 'deleted_at' => null])->get()->getResultArray();
            $data = [
                "jumlah_anakAktif" => sizeof($dataAnakAktif),
                "jumlah_anakDalam" => sizeof($dataAnakDalam),
                "jumlah_anakLuar" => sizeof($dataAnakLuar),
                "jumlah_donatur" => sizeof($dataDonatur),
            ];
            return view('dashboard/report_data', $data);
        } elseif ($_GET['act'] == "reportKeuangan") {
            $id_panti = $this->session->get('ID_PANTI');
            $mpemasukan = new Pemasukan();
            $dataJumlahPemasukan = $mpemasukan->where(['id_panti' => $id_panti, 'deleted_at' => null])->selectSum('jumlah')->get()->getRow();
            $dataPemasukanPertama = $mpemasukan->where(['id_panti' => $id_panti, 'deleted_at' => null])->orderBy("id", "ASC")->get()->getRowArray();
            $mpengeluaran = new Pengeluaran();
            $dataTotalPengeluaran = $mpengeluaran->where(['id_panti' => $id_panti, 'deleted_at' => null])->selectSum('total_pengeluaran')->get()->getRow();
            $dataPengeluaranPertama = $mpengeluaran->where(['id_panti' => $id_panti, 'deleted_at' => null])->orderBy("id", "ASC")->get()->getRowArray();
---
SELECT *
FROM `anak_asuh`
WHERE `id_panti` = '1'
AND `status_anak` = 'Aktif'
AND `status_panti` = 'Anak Asuh Mukim'
AND `deleted_at` IS NULL
SELECT *
FROM `anak_asuh`
WHERE `id_panti` = '1'
AND `status_panti` = 'Anak Asuh Mukim'
AND `deleted_at` IS NULL
SELECT *
FROM `anak_asuh`
WHERE `id_panti` = '1'
AND `status_panti` = 'Anak Asuh Luar'
AND `deleted_at` IS NULL
SELECT *
FROM `donatur`
WHERE `id_panti` = '1'
AND `deleted_at` IS NULL
SELECT SUM(`jumlah`) AS `jumlah`
FROM `pemasukan`
WHERE `id_panti` = '1'
AND `deleted_at` IS NULL
SELECT *
FROM `pemasukan`
WHERE `id_panti` = '1'
AND `deleted_at` IS NULL
ORDER BY `id` ASC
SELECT SUM(`total_pengeluaran`) AS `total_pengeluaran`
FROM `pengeluaran`
WHERE `id_panti` = '1'
AND `deleted_at` IS NULL
SELECT *
FROM `pengeluaran`
WHERE `id_panti` = '1'
AND `deleted_at` IS NULL
ORDER BY `id` ASC

            }
            $id_panti = $this->session->get('ID_PANTI');
            $mpemasukan = new Pemasukan();
            $dataJumlahPemasukan = $mpemasukan->where('tanggal_pemasukan >=', $startDate)->where('tanggal_pemasukan <=', $endDate)->where(['id_panti' => $id_panti, 'deleted_at' => null])->selectSum('jumlah')->get()->getRow();
            $mpengeluaran = new Pengeluaran();
            $dataTotalPengeluaran = $mpengeluaran->where('tgl_pengeluaran >=', $startDate)->where('tgl_pengeluaran <=', $endDate)->where(['id_panti' => $id_panti, 'deleted_at' => null])->selectSum('total_pengeluaran')->get()->getRow();
---
SELECT SUM(`jumlah`) AS `jumlah`
FROM `pemasukan`
WHERE `tanggal_pemasukan` >= '2024-01-12 00:00:00'
AND `tanggal_pemasukan` <= '2024-01-12 23:59:59'
AND `id_panti` = '1'
AND `deleted_at` IS NULL
SELECT SUM(`total_pengeluaran`) AS `total_pengeluaran`
FROM `pengeluaran`
WHERE `tgl_pengeluaran` >= '2024-01-12 00:00:00'
AND `tgl_pengeluaran` <= '2024-01-12 23:59:59'
AND `id_panti` = '1'
AND `deleted_at` IS NULL

        } elseif ($_GET['act'] == "chart_pemasukan") {
            $id_panti = $this->session->get('ID_PANTI');
            $mpemasukan = new Pemasukan();
            $dataPemasukan = $mpemasukan->select("sumber, COUNT(*) as count")->groupBy("sumber")->orderBy("count", "DESC")->where(['id_panti' => $id_panti, 'deleted_at' => null])->limit(4)->get()->getResultArray();
---
SELECT `sumber`, COUNT(*) as count
FROM `pemasukan`
WHERE `id_panti` = '1'
AND `deleted_at` IS NULL
GROUP BY `sumber`
ORDER BY `count` DESC
 LIMIT 4

        } elseif ($_GET['act'] == "chart_pengeluaran") {
            $id_panti = $this->session->get('ID_PANTI');
            $mpengeluaran = new Pengeluaran();
            $dataPengeluaran = $mpengeluaran->select("kategori, COUNT(*) as count")->groupBy("kategori")->orderBy("count", "DESC")->where(['id_panti' => $id_panti, 'deleted_at' => null])->limit(4)->get()->getResultArray();
---
SELECT `kategori`, COUNT(*) as count
FROM `pengeluaran`
WHERE `id_panti` = '1'
AND `deleted_at` IS NULL
GROUP BY `kategori`
ORDER BY `count` DESC
 LIMIT 4