app/Controllers/Donatur.php

  public function get_data()
  {
    if ($this->session->get('NAMA') == null)  return redirect()->to(base_url());
    if ($_GET['act'] == "tabel-donatur") {
      $id_panti = $this->session->get('ID_PANTI');
      $mdonatur = new ModelsDonatur();
      $dataDonatur = $mdonatur->where(['id_panti' => $id_panti, 'deleted_at' => null])->get()->getResultArray();
---
SELECT *
FROM `donatur`
WHERE `id_panti` = '1'
AND `deleted_at` IS NULL
ORDER BY `id` DESC