app/Controllers/Keuangan.php

SELECT *
FROM `pengeluaran`
WHERE `id` = '1'
AND `deleted_at` IS NULL
SELECT *
FROM `item_pengeluaran`
WHERE `id_pengeluaran` = '1'
AND `deleted_at` IS NULL
---
    public function view()
    {
        if ($this->session->get('NAMA') == null)  return redirect()->to(base_url());
        if (!isset($_GET['id'])) return redirect()->to(base_url());
        $mpengeluaran = new Pengeluaran();
        $mitem = new ItemPengeluaran();
        $dataPengeluaran = $mpengeluaran->where(['id' => $_GET['id'], 'deleted_at' => null])->get()->getRowArray();
        $dataItem = $mitem->where(['id_pengeluaran' => $_GET['id'], 'deleted_at' => null])->get()->getResultArray();
        $data = [
            "page_title" => "Detail Pengeluaran",
            "session" => $this->session->get(),
            "pengeluaran" => $dataPengeluaran,
            "dataItem" => $dataItem,
        ];

UPDATE `pengeluaran` SET `id_panti` = '1', `tgl_pengeluaran` = '2023-11-20', `judul` = 'Testing 1', `total_pengeluaran` = '80000', `keterangan` = 'Lorem ipsum dolor'
WHERE `id` = '1'
---
                ];
                $mpengeluaran = new Pengeluaran();
                $mitem = new ItemPengeluaran();
                $updateData = $this->db->table("pengeluaran")->update($input_data, ['id' => $_POST['idPengeluaran']]);

UPDATE `item_pengeluaran` SET `id_pengeluaran` = '1', `item` = 'Kangkung', `jumlah` = '10', `harga` = '3000', `total_harga` = '30000'
WHERE `id` = '1'
---
                    if ($_POST['idItemPengeluaran'][$i] == 'new') {
                        $mitem->save($data_item);
                    } else {
                        $this->db->table("item_pengeluaran")->update($data_item, ['id' => $_POST['idItemPengeluaran'][$i]]);

SELECT *
FROM `pengeluaran`
WHERE `id` = '1'
---
                }
                if (!empty($_FILES['fileUpload']['name'][0])) {
                    $files = $this->request->getFiles();
                    $pengeluaran = $this->db->table("pengeluaran")->select("*")->where("id", $_POST['idPengeluaran'])->get()->getRowArray();

UPDATE `pengeluaran` SET `file` = '[\"1703310512_e6f93a50b23ee5cc881e.jpg\",\"1703310582_8d9a907996cd08787ff0.pdf\"]'
WHERE `id` = '1'
---
                            $file->move(FCPATH . 'uploads/pengeluaran', $newName);
                        }
                    }
                    $this->db->table("pengeluaran")->update(['file' => json_encode($newFile)], ['id' => $_POST['idPengeluaran']]);