app/Controllers/Keuangan.php

SELECT *
FROM `pengeluaran`
WHERE `id_panti` = '1'
AND `deleted_at` IS NULL
ORDER BY `tgl_pengeluaran` DESC
---
    public function get_data()
    {
        if ($this->session->get('NAMA') == null)  return redirect()->to(base_url());
        if ($_GET['act'] == "tabel-keuangan") {
            $id_panti = $this->session->get('ID_PANTI');
            $mpengeluaran = new Pengeluaran();
            $dataKeuangan = $mpengeluaran->where(['id_panti' => $id_panti, 'deleted_at' => null])->orderBy("tgl_pengeluaran", "desc")->get()->getResultArray();