app/Controllers/Pemasukan.php

SELECT *
FROM `donatur`
WHERE `id_panti` = '1'
AND `deleted_at` IS NULL
ORDER BY `id` DESC
---
  public function index()
  {
    if ($this->session->get('NAMA') == null)  return redirect()->to(base_url());
    $id_panti = $this->session->get('ID_PANTI');
    $mdonatur = new Donatur();
    $dataDonatur = $mdonatur->where(['id_panti' => $id_panti, 'deleted_at' => null])->get()->getResultArray();

SELECT *
FROM `pemasukan`
WHERE `id_panti` = '1'
AND `deleted_at` IS NULL
ORDER BY `tanggal_pemasukan` DESC, `id` DESC
---
  public function get_data()
  {
    if ($this->session->get('NAMA') == null)  return redirect()->to(base_url());

    if ($_GET['act'] == "tabel-pemasukan") {
      $id_panti = $this->session->get('ID_PANTI');
      $mpemasukan = new ModelsPemasukan();
      $datamPemasukan = $mpemasukan->where(['id_panti' => $id_panti, 'deleted_at' => null])->orderBy("tanggal_pemasukan", "DESC")->get()->getResultArray();

SELECT *
FROM `pemasukan`
WHERE `id` = '4'
AND `deleted_at` IS NULL
---
  public function edit()
  {
    if ($this->session->get('NAMA') == null)  return redirect()->to(base_url());
    $mpemasukan = new ModelsPemasukan();
    $datamPemasukan = $mpemasukan->where(['id' => $_GET['id'], 'deleted_at' => null])->get()->getRowArray();

SELECT *
FROM `pemasukan`
WHERE `id` = '4'
---
      ];
      echo json_encode($data);
    } elseif ($_GET['act'] == "delete_file") {
      $pemasukan = $this->db->table("pemasukan")->select("*")->where("id", $_POST['id'])->get()->getRowArray();

UPDATE `pemasukan` SET `file` = '[]'
WHERE `id` = '4'
---
          unset($file[$key]);
        }
      }
      $updateFile = $this->db->table("pemasukan")->update(['file' => json_encode($file)], ['id' => $_POST['id']]);