app/Controllers/Pemasukan.php

  public function edit()
  {
    if ($this->session->get('NAMA') == null)  return redirect()->to(base_url());
    $id_panti = $this->session->get('ID_PANTI');
    $mpemasukan = new ModelsPemasukan();
    $datamPemasukan = $mpemasukan->where(['id' => $_GET['id'], 'deleted_at' => null])->get()->getRowArray();
    $mdonatur = new Donatur();
    $dataDonatur = $mdonatur->where(['id_panti' => $id_panti, 'deleted_at' => null])->get()->getResultArray();
---
SELECT *
FROM `donatur`
WHERE `id_panti` = '1'
AND `deleted_at` IS NULL