app/Views/layouts/layout.php

  $this->session = session();
  $id_panti = $this->session->get('ID_PANTI');
  $this->db = \Config\Database::connect();
  $panti = $this->db->table("panti")->select("*")->where("id", $id_panti)->get()->getRowArray();
---
SELECT *
FROM `panti`
WHERE `id` = '1'